tutorials/compressible/nexaFoam/obliqueShock_pureMixture/constant/polyMesh/boundary
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2412                                  |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    arch        "LSB;label=32;scalar=64";
    class       polyBoundaryMesh;
    location    "constant/polyMesh";
    object      boundary;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

5
(
    top
    {
        type            wall;
        inGroups        1(wall);
        nFaces          60;
        startFace       3510;
    }
    inlet
    {
        type            patch;
        nFaces          30;
        startFace       3570;
    }
    outlet
    {
        type            patch;
        nFaces          30;
        startFace       3600;
    }
    bottom
    {
        type            symmetryPlane;
        inGroups        1(symmetryPlane);
        nFaces          60;
        startFace       3630;
    }
    frontAndBack
    {
        type            empty;
        inGroups        1(empty);
        nFaces          3600;
        startFace       3690;
    }
)

// ************************************************************************* //
